#include "ui.h"
#include "dungeon.h"
#include "character.h"

#include <iostream>

using namespace std;

void wait()
{
    cout << "\n[Enter] для продолжения...";
    cin.get();
}

void intro(Character& player)
{
    cout << "Птички поют, журчит речушка вдоль моста, коровы жуют травку...\n";
    cout << "Блаженный сон сменятеся звоном в ушах...\n";
    cout << "Голова трещит от боли...\n";
    cout << "Вы просыпаетесь в каком-то переулке...\n";
    cout << "Вы встаете на ноги.\n";
    wait();

    int choice;
    cout << "При попытке вспомнить хоть что-то, у Вас начинает трещать голова.\n"
            "Вы решаете осмотреться в поисках чего-то, что поможет понять, что вы тут делаете,\n"
            "Но вокруг ничего кроме, крыс, мусора и спящего пьянчуги.\n"
            "-Может в карманах что-нибудь найдется?\n";
            wait();
    cout << "[1]Пошариться в своих карманах\n"
            "[2]Пошариться в карманах спящего незнакомца\n"
            ">>> ";
    cin >> choice;
    cin.ignore();

    if (choice == 1)
    {
        cout << "Вы нашли мертвую крысу\n";
        cout << "Голод утолен\n";
        player.satiety = min(player.satietyMAX, player.satiety + 5);
        cout << "Сытость + 5 | (" << player.satiety << "/" << player.satietyMAX <<") \n";
        wait();
    }
    else if (choice == 2)
    {
        cout << "Вы нашли пару монет\n";
        player.gold += 5;
        cout << "Золото + 5 | Всего золота: " << player.gold << "\n";
        wait();
    }
    else
    {
        cout << "Вы ничего не нашли\n";
        wait();
    }

    cout << "Придя в себя, Вы подошли к первому попавшемуся Незнакомцу\n"
            "Вы сразу начали расспрашивать где вы находитесь и как сюда попали, на что Незнакомец отвечает:\n"
            "-И тебе привет, дружище, смотрю много вчера выпил!\n"
            "-Давай по-порядку, тебя то как звать ?\n";
    getline (cin, player.name);

    cout << "-Ну и назвали же тебя родители хахаха...\n"
            "-Ладно, как знать, рад познакомиться, " << player.name << "!\n"
            "-Сейчас ты находишься в городе Элизиум\n"
            "-За проулком слева у нас Центр Города, но тебя в такой одежке туда стража не пустит.\n"
            "-Дальше по тропинке Таверна 'Лесной Вереск'\n"
            "-Можешь сходить поесть чего-нибудь, если голоден.\n"
            "-А вниз по улице расположились Гильдия Охотников и Штат Стражи Элизиума\n"
            "-Eсли хочешь подзаработать - тебе туда!\n"
            "-Ах да, ещё у нас тут Колодец один есть, но тебе туда рано пока, разве что устроишь кое-кому или чему обед!\n"
            "-Ладно, я побежал, дальше сам давай\n";
            wait();
}

void city(Character& player)
{
    bool city = true;
    while (city)
    {
        cout << "=======ГОРОД=======\n"
                "[1]Спуститься в подземелья\n"
                "[2]Таверна\n"
                "[3]Гильдия Искателей\n"
                "[4]Стража Элизиума\n"
                "[5]Персонаж\n"
                "[6]Выход\n";
        
        int cmd;
        cin >> cmd;
        cin.ignore();

        switch (cmd)
        {
        case 1:             //Допилить спуск в подземелья
            {
            dungeon(player);
            break;
            }

        case 2:             //Допилить
            {
            cout << "\n"; 
            break;
            }

        case 3:             //Допилить
            {
            cout << "\n";
            break;
            }

        case 4:             //Допилить
            {
            cout << "\n";
            break;
            }

        case 5:
            {
            printCharacter(player);
            wait();
            break;
            }

        case 6:
            {
                char answer;
                cout << "Вы уверенны, что хотите ВЫЙТИ?  y/n\n";
                cin >> answer;
                cin.ignore();
                if (answer == 'y' || answer == 'Y')
                {
                    cout << "До встречи\n";
                    city = false;

                }
                else if (answer == 'n' || answer == 'N')
                {
                    cout << "Отлично, поиграем ещё!\n";
                }
                else 
                {
                    cout << "Непонятный ответ. Возвращаемся в меню.\n";
                }
                break;
            }
        
        default:
            cout << "Неверный выбор. Попробуйте снова.\n";
            wait();
            break;
        }
    }
}